esjson=[
	"Sobre mí",
	"Nombre completo:",
	"Teléfono:",
	"Correo electrónico:",
	"Dirección:",
	"¡Hola!",
	"Empecé a estudiar mi carrera en 2012, dando así comienzo a mi ascenso en el mundo de la ingeniería electrónica. Muy pronto empecé a tener más interés en los proyectos de programación que iba desarrollando. Como consecuencia de esto aprendí y amplié mis conocimientos en diferentes lenguajes de programación y cree el conjunto de herramientas que presento a continuación. Una decisión muy relevante en mi vida académica fue participar en un proyecto Erasmus. Esta experiencia no solo me ofreció una nueva perspectiva de diferentes culturas, sino que también me permitió comprobar y aumentar mis capacidades.	En 2015 empecé mi máster en Ingeniería Electrotécnica y de Ordenadores - Telecomunicación. Adquirí nuevas competencias tecnológicas, aprendí nuevos lenguajes de programación (Java y Perl) y afiancé mis conocimientos. Terminé la tesis de mi máster después de mis prácticas en la empresa Gisgeo. Estas prácticas me ayudaron a solidificar mi deseo de tener una carrera profesional y me ayudaron a integrarme en el contexto empresarial.Puedo ofrecer una buena base de conocimientos, una gran motivación para aprender y un excelente espíritu de equipo. En mi opinión, mi mejor cualidad es la rapidez con la que adquiero conocimientos/competencias y también la velocidad con la que me adapto a nuevos conceptos y contextos.",
	"Competencias",
	"<strong>HTML</strong>Competente",
	"<strong>MySQL</strong>Competente",
	"<strong>Javascript</strong>Competente",
	"<strong>PHP</strong>Competente",
	"<strong>CSS</strong>Avanzado",
	"<strong>C</strong>Avanzado",
	"<strong>PostgreSQL</strong>Razonable",
	"<strong>PERL</strong>Razonable",
	"<strong>Java</strong>Razonable",
	"<strong>Python<strong>Principiante</strong></strong>",
	"<strong>C++</strong>Principiante",
	"<strong>LATEX</strong>Principiante",
	"<strong>Matlab</strong>Principiante",
	"Bibliotecas y <i>Frameworks</i> de Software",
	"Competente",
	"Competente",
	"Competente",
	"Competente",
	"Avanzado",
	"Avanzado",
	"Avanzado",
	"Avanzado",
	"Razonable",
	"Razonable",
	"Principiante",
	"Principiante",
	"Sistemas Operativos",
	"Avanzado",
	"Razonable",
	"Principiante",
	"Idiomas",
	"Portugués",
	"Nativo",
	"Inglés",
	"Francés",
	"<u>Competente</u> - Nivel elevado de conocimiento y experiencia | <u>Avanzado</u> - Nivel elevado de conocimiento y buen nivel de experiencia<br><u>Razonable</u> - Buen nivel de conocimiento con experiencia limitada | <u>Principiante</u> - Nivel básico de conocimiento y poca o ninguna experiencia",
	"Mi currículum",
	"Experiencia profesional",
	"Full Stack Software Developer",
	"Actual",
	"<p>Como desarrollador de software full stack desarrollé varias herramientas para auxiliar el proceso de traducción, así como los procesos de gestión de proyectos y recursos.</p><br><p>La mayor parte de mis proyectos fueron desarrollados en Laravel. Pero también trabajé en algunos proyectos legacy desarrollados en PHP puro y llevé a cabo la migración de otros proyectos a Laravel.</p> ",
	"Software Developer en prácticas",
	"Mis prácticas se centraron en el desarrollo de una aplicación web \"GeoCarEyes\" que iba a integrarse en un producto base \"GeoCar\".También documenté todos los aspectos de esta nueva aplicación, desde guías para futuros desarrollos a guías para los usuarios.<br>Aunque este producto era el objetivo principal de mis prácticas, durante mi tiempo libre desarrollé algunas herramientas internas para auxiliar los procesos internos de la empresa.",
	"Gestor eléctrico",
	"Durante mi experiencia \"Erasmus Project Semester\" (EPS) participé en el equipo Formula Cruisers para el diseño y construcción de un coche de carreras para la competición Formula Student.<br>Como gestor eléctrico, supervisé el diseño y el montaje de todos los componentes eléctricos para garantizar que cumplieran las reglas establecidas por las normas de Formula Student y para que se integraran en el coche de carreras.<br>Aunque mi rol laboral era gestionar el equipo eléctrico, también participé en el desarrollo de estos componentes, especialmente durante los momentos de más presión y con escasez de tiempo.",
	"Educación",
	"International English Language Testing System (IELTS)",
	"Un examen de certificación en inglés.<br>Nota final: IELTS band 8/9<br>(Audición: 9, lectura: 8.5, escritura: 7, hablado: 8)",
	"Máster en Ingeniería Electrotécnica y de Ordenadores",
	"La especialización de mi máster fue Telecomunicaciones, algo que me permitió desarrollar mis competencias en las redes, así como mejorar mis competencias de programación, en concreto de programación web.<br>Nota final: 16/20",
	"Curso de gestión Ágil de proyectos con Scrum y Kanban",
	"Instituto Superior de Engenharia do Porto (ISEP) - 2017 Jul. (16 horas)",
	"Un curso certificado sobre las bases de desarrollo \"Agile\" enfocado sobre todo en las metodologías establecidas como Scrum y Kanban",
	"Proyecto Erasmus (European Project Semester, EPS)",
	"The Hague University of Applied Sciences (Holanda) - 2015 Ene. - 2015 Jul.",
	"Mi proyecto EPS consistió en primer lugar en la participación en en la competición Formula Student y surgió así la posibilidad de trabajar con colegas de múltiples nacionalidades en un proyecto multidisciplinar. El proyecto Formula Student es una competición entre estudiantes de ingeniería de todo el mundo que tiene como objetivo construir y competir con un coche de carreras en una pista de carreras (en Silverstone).<br>El coche de carreras superó todas las pruebas obligatorias de seguridad impuestas por el reglamento de Formula Student.",
	"Licenciatura en Ingeniería Electrotécnica y de Ordenadores",
	"Mi licenciatura fue mi primer paso en el mundo de la ingeniería e hizo que desde muy temprano me diera cuenta de mi pasión por la programación.<br>Nota final: 16/20",
	"CISCO's CCNA1 (Cisco Certified Network Associate)",
	"Academia Cisco (Porto) - 2013 Ene. - 2013 Jul.",
	"Un curso certificado de introducción a la arquitectura, estructura, funciones, componentes y modelos de Internet y de otros tipos de redes de ordenadores.",
	"Proyectos",
	"Gestor de Recursos Humanos",
	"Gestor de Relaciones con Contactos",
	"Control automatizado de vehículos/flotas",
	"Diseñador de Catálogos Web",
	"Gestor de gastos compartidos",
	"Conversor Readme",
	"Cree HTML a partir de archivos .md",
	"Ruleta, máquinas tragamonedas y Blackjack",
	"Gestor de Recursos Humanos",
	"Una aplicación web para la gestión de recursos humanos, específicamente en el área de la traducción.<br>Enfocada en el proceso de reclutamiento de traductores/empresas de traducción. También contempla la probabilidad de integrarlo con TMS (Translation Management System), permitiendo así una gestión continua de los recursos de traducción.",
	"<a href=\"https://altec-is.pt/#hrm\" target=\"_blank\"><i class=\"icon-link\"></i>&nbsp;Link para página</a>",
	"Gestor de Relaciones con Contactos",
	"Una aplicación web para la gestión de las relaciones de sus contactos.<br>A través de la API de Gmail, establece una conexión con su cuenta de correo electrónico y mapea sus correos en contactos, empresas y oportunidades. Es una herramienta importante para la organización de sus clientes actuales y posibles, y hasta para la gestión de sus recursos/proveedores.",
	"Una interfaz dinámica para la gestión de frutas.<br>Ofrece servicios de monitorización en tiempo real de los vehículos, flujo de tráfico, alertas, servicios agendados, índices de eficiencia, entre otros. Toda esta información se presenta con un mapa generado con Leaflet.js. Esta aplicación es un complemento para el producto GeoCar desarrollado por Gisgeo.",
	"Una aplicación web para la creación y estilización de catálogos online.<br>A través de una lista de productos (CSV), un usuario podrá subir sus productos y estilizar las tarjetas de los mismos, así como estilizar la página donde se presentarán los productos.<br>Cuando la estilización está lista, se genera un enlace público para acceder al catálogo. ",
	"<a href=\"https://github.com/henriquefig/Cataloguer\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
	"Una aplicación web para que las casas compartidas puedan gestionar los gastos compartidos. Está dirigida a estudiantes que comparten casa, pero puede usarse para cualquier tipo de gasto compartido.",
	"<a href=\"https://github.com/henriquefig/Quem-Paga-o-que-alternative\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
	"Conversor Readme",
	"El conversor README es una pequeña aplicación basada en Showdown.js que ayuda a crear versiones HTML de archivos README (.md).",
	"<a href=\"https://github.com/henriquefig/Readme-converter\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
	"Una pequeña aplicación Java con 3 juegos de azar: Ruleta, máquinas tragamonedas y Blackjack.<br>Un proyecto divertido de la época en la que estaba aprendiendo Java.",
	"<a href=\"https://github.com/henriquefig/CasinoJava_v2\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
	"Contacto",
	"Su nombre",
	"Su dirección de correo electrónico",
	"Su mensaje",
	"Enviar mensaje",
	"Pasatiempos",
	"Cubos",
	"En 2007 aprendí a resolver el cubo de Rubik y desde entonces, este tipo de \"twisty puzzles\" se ha convertido en una pasión para mí.<br>A continuación hay una fotografía de mi <u>actual</u> colección de cubos.",
	"Puedo resolver cualquiera de ellos e incluso participé en algunas competiciones de cubos.<br>Estos son mis mejores tiempos por cada categoría (en algunos de los cubos nunca cronometré, por eso incluyo una media del tiempo que tardo en resolverlos):",
	"<u>2x2x2</u>: 3,64 segundos | <u>3x3x3</u>: 15,94 segundos | <u>3x3x3 con una mano</u>: 41,56 segundos | <u>4x4x4</u>: 58,15 segundos<br><u>5x5x5</u>: 2:34,54 minutos | <u>7x7x7</u>: 7:48,92 minutos | <u>Megaminx</u>: 2:24,66 minutos | <u>Gigaminx</u>: ≈ 30 minutos<br><u>Mastermorphix</u>: ≈ 2/3 minutos | <u>Megamorphix</u>: ≈ 35 minutos | <u>Gigamorphix</u>: ≈ 30 minutos<br><u>Square-1</u> - solo lo resolví una o dos veces. Todavía no puedo dar una media de tiempo",
	"Música",
	"Cuando tenía 10 anos mis padres pensaron que era buena idea que aprendiera música, por eso empecé a recibir clases de piano.Estos fueron mis primeros pasos en la música y aunque no tuviera especial interés en aprender a tocar el piano, despertó mi interés por la música.<br>En 2011 sostuve un bajo en mis manos por primera vez y ha sido mi instrumento de elección desde entonces.<br>A continuación incluyo una fotografía de mi querido bajo.",
	"Por ahora vivo aquí:"
]