ptjson = [
    "Sobre mim",
    "Nome completo:",
    "Telefone:",
    "Email:",
    "Morada:",
    "Olá!",
    "Começei o meu curso em 2012, começando a minha escalada no mundo da engenharia eletrotécnica. Desde cedo, adquiri um grande gosto pelos projetos de programação que fui desenvolvendo. Isto traduziu-se na aprendizagem e desenvolvimento em diferentes linguagens de programação, criando o leque de ferramentas que apresento de seguida.\n\t\t\t\t\t\tUma decisão muito relevante na minha vida académica foi a participação num projeto Erasmus. Esta experiencia ofereceu me não só uma nova perspetiva sobre as diferentes culturas, como me permitiu testar e exceder as minhas capacidades.\n\t\t\t\t\t\tEm 2015 iniciei o meu Mestrado em Engenharia Eletrotécnica e de Computadores – Telecomunicações, adquirindo novas competências tecnológicas, aprendendo novas linguagens de programação (Java e Perl) e solidificando a base do meu conhecimento.\n\t\t\t\t\t\tFinalizei a minha tese de mestrado após o meu estágio na Gisgeo. Este estágio solidificou os meus desejos de carreira, ajudando me também na integração no contexto empresarial.\n\t\t\t\t\t\tPosso oferecer uma boa base de conhecimentos, uma forte motivação para a aprendizagem e um ótimo espírito de equipa. A meu ver, a minha maior qualidade será a velocidade com que consigo adquirir conhecimentos/competências e adaptar-me a estes novos conceitos e contextos.\n\t\t\t\t\t\t",
    "Competências",
    "<strong>HTML</strong>Proficiente",
    "<strong>MySQL</strong>Proficiente",
    "<strong>Javascript</strong>Proficiente",
    "<strong>PHP</strong>Proficiente",
    "<strong>CSS</strong>Avançado",
    "<strong>C</strong>Avançado",
    "<strong>PostgreSQL</strong>Razoável",
    "<strong>PERL</strong>Razoável",
    "<strong>Java</strong>Razoável",
    "<strong>Python<strong>Principiante</strong></strong>",
    "<strong>C++</strong>Principiante",
    "<strong>LATEX</strong>Principiante",
    "<strong>Matlab</strong>Principiante",
    "Bibliotecas e <i>Frameworks</i> de Software",
    "Proficiente",
    "Proficiente",
    "Proficiente",
    "Proficiente",
    "Avançado",
    "Avançado",
    "Avançado",
    "Avançado",
    "Razoável",
    "Razoável",
    "Principiante",
    "Principiante",
    "Sistemas Operativos",
    "Avançado",
    "Razoável",
    "Principiante",
    "Línguas",
    "Português",
    "Nativo",
    "Inglês",
    "Françês",
    "\n\t\t\t\t\t<u>Proficiente</u> - Nível elevado de conhecimento e experiência | \n\t\t\t\t\t<u>Avançado</u> - Nível elevado de conhecimento e bom nível de experiência <br>\n\t\t\t\t\t<u>Razoável</u> - Bom nível de conhecimento com experiência limitada | \n\t\t\t\t\t<u>Principiante</u> - Nível básico de conhecimento e pouca ou nenhuma experiência\n\t\t\t\t",
    "O meu Currículo",
    "Experiência profissional",
    "Fullstack Software Developer",
    "Actual",
    "\n\t\t\t\t\t\t\t\t\t\t<p>Como fullstack software developer desenvolvi várias ferramentas para auxiliar o processo de tradução, bem como nos processos de gestão de projetos e recursos.</p><br>\n\t\t\t\t\t\t\t\t\t\t<p>A maioria dos meus projetos foram desenvolvidos em Laravel, embora tenha trabalhado em alguns projetos legacy desenvolvidos em PHP puro, assim como, migrado alguns para Laravel.</p>\n\t\t\t\t\t\t\t\t\t",
    "Estagiário Software Developer",
    "\n\t\t\t\t\t\t\t\t\t\t\tO meu estágio foi focado no desenvolvimento de uma aplicação web \"GeoCarEyes\" para a sua integração com um produto base \"GeoCar\".\n\t\t\t\t\t\t\t\t\t\t\tTambém documentei todos os aspetos desta nova aplicação, desde guias para futuros desenvolvimentos a guias para os utilizadores.<br>\n\t\t\t\t\t\t\t\t\t\t\tApesar deste produto ser o objetivo principal do meu estágio, no meu tempo mais livre desenvolvi algumas ferramentas internas para a ajudar os processos internos da empresa.\n\t\t\t\t\t\t\t\t\t\t",
    "Gestor elétrico",
    "\n\t\t\t\t\t\t\t\t\t\t\tDurante a minha experiência \"Erasmus Project Semester\" (EPS) participei na equipa Formula Cruisers para o design e construção de um carro de corrida para a competição Formula Student.<br>\n\t\t\t\t\t\t\t\t\t\t\tComo Gestor Elétrico, supervisionei o design e a montagem de todos os componentes elétricos, garantindo que estes cumpriam as regras estabelecidas pelo regulamento do Formula Student, bem como, como estes se integrariam no carro de corrida.<br>\n\t\t\t\t\t\t\t\t\t\t\tApesar de o meu trabalho ser de gestão da equipa elétrica, também participei no desenvolvimento destes componentes, especialmente nos momentos de maior pressão e com escassez de tempo. \n\t\t\t\t\t\t\t\t\t\t",
    "Educação",
    "International English Language Testing System (IELTS)",
    "\n\t\t\t\t\t\t\t\t\t\t\tUm exame de certificação em Inglês.<br>\n\t\t\t\t\t\t\t\t\t\t\tNota final: IELTS band 8/9<br>(Audição: 9, Leitura: 8.5, Escrita: 7, Fala: 8)\n\t\t\t\t\t\t\t\t\t\t\t",
    "Mestrado em Engenharia Eletrotécnica e de Computadores",
    "A especialização do meu mestrado foi Telecomunicações, que me permitiu desenvolver as minhas competências em redes, bem como melhorar as minhas competências de programação, especificamente programação web.<br>\n\t\t\t\t\t\t\t\t\t\t\tNota final: 16/20",
    "Curso de Gestão Ágil de Projetos com Scrum e Kanban",
    "Instituto Superior de Engenharia do Porto (ISEP) - 2017 Jul. (16 horas)",
    "Um curso certificado sobre as bases de desenvolvimento \"Agile\" com um maior foco em metodologias estabelecidas como Scrum e Kanban",
    "Projeto Erasmus (European Project Semester, EPS)",
    "The Hague University of Applied Sciences (Holanda) - 2015 Jan. - 2015 Jul.",
    "\n\t\t\t\t\t\t\t\t\t\t\tO meu projecto EPS consistiu primáriamente na participação na competição Formula Student dando-me a possibilidade de trabalhar com colegas de múltiplas nacionalidades num projeto multidisciplinar.\n\t\t\t\t\t\t\t\t\t\t\tO Formula Student é uma competição entre estudantes de engenharia de todo o mundo com o objetivo de construir e competir com um carro de corridas num circuito de corridas (em Silverstone).<br>\n\t\t\t\t\t\t\t\t\t\t\tO carro de corrida passou também todos os testes obrigatórios de segurança, impostos pelo regulamento do Formula Student.",
    "Licenciatura em Engenharia Eletrotécnica e de Computadores",
    "A minha licenciatura foi o primeiro passo no mundo da engenharia e desde cedo me fez aperceber da minha paixão por programação.<br>\n\t\t\t\t\t\t\t\t\t\tNota final: 16/20",
    "CISCO's CCNA1 (Cisco Certified Network Associate)",
    "Academia Cisco (Porto) - 2013 Jan. - 2013 Jul.",
    "Um curso certificado que introduz a arquitectura, estrutura, funções, componentes e modelos da Internet e de outros tipos de redes de computadores.\n\t\t\t\t\t\t\t\t\t\t",
    "Projetos",
    "Gestor de Recursos Humanos",
    "Gestor de Relacionamento com Contatos",
    "Controlo automatizado de veículos/frotas",
    "Designer de Catálogos Web",
    "Gestor de Despesas Partilhadas",
    "Conversor Readme",
    "Crie HTML a partir de ficheiros .md",
    "Roleta, Slot machines e Blackjack",
    "Gestor de Recursos Humanos",
    "\n\t\t\t\t\t\t\t\tUma aplicação web para a gestão de recursos humanos, especificamente no domínio da tradução.<br>\n\t\t\t\t\t\t\t\tFoca-se no processo de recrutamento de tradutores/empresas de tradução. Também contempla a possibilidade de integração com TMS (Translation Management System), permitindo uma gestão continua dos recursos de tradução.",
    "<a href=\"https://altec-is.pt/#hrm\" target=\"_blank\"><i class=\"icon-link\"></i>&nbsp;Link para página</a>",
    "Gestor de Relacionamento com Contatos",
    "Uma aplicação web para a gestão dos relacionamentos dos seus contactos.<br>\n\t\t\t\t\t\t\t\t Através da API do Gmail, estabelece uma conexão com a sua conta de email e faz um mapeamento dos seus emails em contactos, empresas e oportunidades. É uma ferramenta importante para a organização dos seus atuais e possíveis clientes e até para gestão dos seus recursos/fornecedores.",
    "Uma interface dinâmica para a gestão de frotas.<br>\n\t\t\t\t\t\t\t\t Ofereçe serviços como monitorização em tempo real dos veículos, fluxo de tráfego, alertas, serviços agendados, índices de eficiência, entre outros. Toda esta informação é apresentada através de um mapa gerado por Leaflet.js. Esta aplicação serve de complemento ao produto GeoCar desenvolvido pela Gisgeo.\n\t\t\t\t\t\t\t\t",
    "Uma aplicação web para a criação e estilização de catálogos online.<br>\n\t\t\t\t\t\t\t\tAtravés de uma listagem de produtos (CSV), um utilizador poderá fazer o upload dos seus produtos e estilizar os cartões para os mesmos, bem como estilizar a página onde os produtos serão apresentados.<br>\n\t\t\t\t\t\t\t\tApós a estilização pretendida estiver terminada, é gerado um link público para o acesso ao catálogo. ",
    "<a href=\"https://github.com/henriquefig/Cataloguer\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "Uma aplicação web para ajudar habitações partilhadas a gerirem as suas despesas partilhadas. Está direcionada para estudantes a partilharem habitações mas pode ser usado para qualquer tipo de despesa partilhada.",
    "<a href=\"https://github.com/henriquefig/Quem-Paga-o-que-alternative\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "Conversor Readme",
    "O conversor README é uma pequena aplicação baseada em Showdown.js para ajudar na criação de versões HTML de ficheiros README (.md).",
    "<a href=\"https://github.com/henriquefig/Readme-converter\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "Uma pequena aplicação Java com 3 jogos da sorte: Roleta, Slot Machines, Blackjack.<br>\n\t\t\t\t\t\t\t\tUm projeto divertido do tempo em que estava a aprender Java.",
    "<a href=\"https://github.com/henriquefig/CasinoJava_v2\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "Contato",
    "O seu nome",
    "O seu endereço de email",
    "A sua mensagem",
    "Enviar mensagem",
    "Passatempos",
    "Cubos",
    "\n\t\t\t\t\t\t\t\t\tEm 2007 aprendi a resolver o cubo de Rubik e desde então, este tipo de \"twisty puzzles\" têm sido uma paixão para mim.<br>\n\t\t\t\t\t\t\t\t\tAbaixo está uma fotografia da minha <u>atual</u> coleção de cubos.\n\t\t\t\t\t\t\t\t",
    "\n\t\t\t\t\t\t\t\t\tConsigo resolver qualquer um deles e até estive em algumas competições de cubos.<br>\n\t\t\t\t\t\t\t\t\tEstes são os meus melhores tempos para cada categoria (para alguns dos cubos eu nunca cheguei a cronometrar, portanto deixo uma média do tempo que demoro a resolvê-los):\n\t\t\t\t\t\t\t\t",
    "\n\t\t\t\t\t\t\t\t\t<u>2x2x2</u>: 3.64 segundos | <u>3x3x3</u>: 15.94 segundos | <u>3x3x3 com uma mão</u>: 41.56 segundos | <u>4x4x4</u>: 58.15 segundos<br>\n\t\t\t\t\t\t\t\t\t<u>5x5x5</u>: 2:34.54 minutos | <u>7x7x7</u>: 7:48.92 minutos | <u>Megaminx</u>: 2:24.66 minutos | <u>Gigaminx</u>: ≈ 30 minutos<br>\n\t\t\t\t\t\t\t\t\t<u>Mastermorphix</u>: ≈ 2/3 minutos | <u>Megamorphix</u>: ≈ 35 minutos | <u>Gigamorphix</u>: ≈ 30 minutos<br>\n\t\t\t\t\t\t\t\t\t<u>Square-1</u> - só o resolvi uma ou duas vezes, ainda não consigo dar um tempo médio",
    "Música",
    "\n\t\t\t\t\t\t\t\t\tQuando tinha 10 anos os meus pais acharam que seria bom para mim aprender música, como tal, começei com aulas de piano. Estes foram os meus primeiros passos na música e apesar do piano não ser um instumento que eu quisess particularmente aprender, despertou o meu interesse em criar música.<br>\n\t\t\t\t\t\t\t\t\tEm 2011 peguei num baixo pela primeira vez e tem sido o meu instrumento de escolha desde então!<br>\n\t\t\t\t\t\t\t\t\tAbaixo está uma fotografia do meu querido baixo.\n\t\t\t\t\t\t\t\t",
    "\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t",
    "De momento, vivo aqui:"
]