ptjson = {
    "about": "Sobre mim",
    "fullname": "Nome completo:",
    "hello": "Olá!",
    "intro": "Gosto de código? Adoro, mas a vida não seria tão boa se não conhecesse o impacto do meu trabalho nas vidas dos nossos clientes, nas vidas dos meus colegas e mesmo na minha vida.<br><br>Como engenheiro de integrações, trabalhei com inúmeras APIs (SOAP/REST), modos de autenticação e desafios de arquitectura. O meu contacto com diversas APIs fez de mim defensor ávido de boa documentação e o meu contacto mais próximo com clientes ou parceiros fez-me adoptar a abordagem ATTYC (Avoid tears, test your code!), priorizando a criação de testes para cada pedaço de código.<br><br>Neste momento estou na navegar pelo mar de Laravel tendo grande interesse na área de segurança, autenticação e integridade de infraestrutura. A nível mais pessoal, sou um pequeno gafanhoto que se encontra deslumbrado com o mundo de Go.<br><br>Acredito que todos os momentos, todos os caminhos são oportunidades para aprender. O meu mindset de estudante sempre me acompanhará, mesmo quando estiver a ensinar ou mentorar, mesmo quando apresentar o meu trabalho cheio de orgulho e de certezas, vou sempre procurar novas coisas para aprender.",
    "mycv": "O meu Currículo",
    "workexp": "Experiência profissional",
    "integrationseng": "Engenheiro de Integrações",
    "current": "Actual",
    "infraspeak-job-desc": "Como Engenheiro de Integrações, sou responsável por prover aos nossos clientes uma experiência simples, funcional e completa permitindo tirar o máximo valor do Infraspeak.<br><br>O nosso lema, \"source of good life\", leva-nos a caminhar para a criação de integrações, bem como desenvolver a nossa API sendo o mais Plug&Play possível, melhorando assim a experiência dos nossos parceiros.<br><br>Passando também pela segurança da nossa API, seja através do desenvolvimento de mecanismos de throttling ou através de sistemas de queues. Bem como pela segurança dos dados dos nossos clientes com sistemas robustos de autenticação, Single Sign-On e Directory syncing.<br><br>Desde o auxilio a integrações externas, através do suporte ao uso da nossa API, criação de integrações tailor-made para os nossos clientes, até ao desenvolvimento de integrações chave como Zapier, SAP, PowerBI, Xero, Nonius, Airthings e um leque de outros softwares importantes nas áreas de Finanças, ERP e Comunicação Social.",
    "fullstack": "Fullstack Software Developer",
    "fullstack-job-desc": "\n\t\t\t\t\t\t\t\t\t\t<p>Como fullstack software developer desenvolvi várias ferramentas para auxiliar o processo de tradução, bem como nos processos de gestão de projetos e recursos.</p><br>\n\t\t\t\t\t\t\t\t\t\t<p>A maioria dos meus projetos foram desenvolvidos em Laravel, embora tenha trabalhado em alguns projetos legacy desenvolvidos em PHP puro, assim como, migrado alguns para Laravel.</p>\n\t\t\t\t\t\t\t\t\t",
    "intern": "Estagiário Software Developer",
    "intern-job-desc":"\n\t\t\t\t\t\t\t\t\t\t\tO meu estágio foi focado no desenvolvimento de uma aplicação web \"GeoCarEyes\" para a sua integração com um produto base \"GeoCar\".\n\t\t\t\t\t\t\t\t\t\t\tTambém documentei todos os aspetos desta nova aplicação, desde guias para futuros desenvolvimentos a guias para os utilizadores.<br>\n\t\t\t\t\t\t\t\t\t\t\tApesar deste produto ser o objetivo principal do meu estágio, no meu tempo mais livre desenvolvi algumas ferramentas internas para a ajudar os processos internos da empresa.\n\t\t\t\t\t\t\t\t\t\t",
    "electmanager": "Gestor elétrico",
    "electmanager-job-desc":"\n\t\t\t\t\t\t\t\t\t\t\tDurante a minha experiência \"Erasmus Project Semester\" (EPS) participei na equipa Formula Cruisers para o design e construção de um carro de corrida para a competição Formula Student.<br>\n\t\t\t\t\t\t\t\t\t\t\tComo Gestor Elétrico, supervisionei o design e a montagem de todos os componentes elétricos, garantindo que estes cumpriam as regras estabelecidas pelo regulamento do Formula Student, bem como, como estes se integrariam no carro de corrida.<br>\n\t\t\t\t\t\t\t\t\t\t\tApesar de o meu trabalho ser de gestão da equipa elétrica, também participei no desenvolvimento destes componentes, especialmente nos momentos de maior pressão e com escassez de tempo. \n\t\t\t\t\t\t\t\t\t\t",
    "education": "Educação",
    "ielts": "International English Language Testing System (IELTS)",
    "ielts-desc": "\n\t\t\t\t\t\t\t\t\t\t\tUm exame de certificação em Inglês.<br>\n\t\t\t\t\t\t\t\t\t\t\tNota final: IELTS band 8/9<br>(Audição: 9, Leitura: 8.5, Escrita: 7, Fala: 8)\n\t\t\t\t\t\t\t\t\t\t\t",
    "masters": "Mestrado em Engenharia Eletrotécnica e de Computadores",
    "masters-desc": "A especialização do meu mestrado foi Telecomunicações, que me permitiu desenvolver as minhas competências em redes, bem como melhorar as minhas competências de programação, especificamente programação web.<br>\n\t\t\t\t\t\t\t\t\t\t\tNota final: 16/20",
    "agile": "Curso de Gestão Ágil de Projetos com Scrum e Kanban",
    "isep": "Instituto Superior de Engenharia do Porto (ISEP) - 2017 Jul. (16 horas)",
    "agile-desc": "Um curso certificado sobre as bases de desenvolvimento \"Agile\" com um maior foco em metodologias estabelecidas como Scrum e Kanban",
    "erasmus": "Projeto Erasmus (European Project Semester, EPS)",
    "hague": "The Hague University of Applied Sciences (Holanda) - 2015 Jan. - 2015 Jul.",
    "erasmus-desc": "\n\t\t\t\t\t\t\t\t\t\t\tO meu projecto EPS consistiu primáriamente na participação na competição Formula Student dando-me a possibilidade de trabalhar com colegas de múltiplas nacionalidades num projeto multidisciplinar.\n\t\t\t\t\t\t\t\t\t\t\tO Formula Student é uma competição entre estudantes de engenharia de todo o mundo com o objetivo de construir e competir com um carro de corridas num circuito de corridas (em Silverstone).<br>\n\t\t\t\t\t\t\t\t\t\t\tO carro de corrida passou também todos os testes obrigatórios de segurança, impostos pelo regulamento do Formula Student.",
    "bachelor": "Licenciatura em Engenharia Eletrotécnica e de Computadores",
    "bachelor-desc": "A minha licenciatura foi o primeiro passo no mundo da engenharia e desde cedo me fez aperceber da minha paixão por programação.<br>\n\t\t\t\t\t\t\t\t\t\tNota final: 16/20",
    "cisco": "CISCO's CCNA1 (Cisco Certified Network Associate)",
    "cisco-academy":"Academia Cisco (Porto) - 2013 Jan. - 2013 Jul.",
    "cisco-desc": "Um curso certificado que introduz a arquitectura, estrutura, funções, componentes e modelos da Internet e de outros tipos de redes de computadores.\n\t\t\t\t\t\t\t\t\t\t",
    "projects": "Projetos",
    "integrations-sec": "Integrações / Segurança e integridade de API",
    "hrm": "Gestor de Recursos Humanos",
    "crm": "Gestor de Relacionamento com Contatos",
    "geocareyes": "Controlo automatizado de veículos/frotas",
    "cataloguer": "Designer de Catálogos Web",
    "qpo": "Gestor de Despesas Partilhadas",
    "readme-converter": "Conversor Readme",
    "readme-converter-sub-title": "Crie HTML a partir de ficheiros .md",
    "infraspeak-desc": "Durante o meu tempo na Infraspeak, desenvolvi diversos projectos, sendo na sua grande maioria integrações com <i>software</i> dos nossos clients - SAP, PowerBI, Zapier, Xero, Airthings, assim como aplicações mais especificas na área de ERP, Finanças, entre outros.<br>Também tive a oportunidade de liderar os diversos <i>upgrade</i> da nossa <i>framework</i>, bem como fazer o <i>upgrade</i> das nossas imagens docker de PHP.<br>Por último, fui também responsavel por desenvolver o nosso sistema de <i>throttling</i>, por implementar e escalar o nosso sistema de <i>Webhooks</i> (usando um sistema de <i>queues</i>) e por desenvolver o mecanismo de autenticação <i>Single Sign-On</i> para os nossos clientes mais <i>enterprise</i>.",
    "hrm-desc":"\n\t\t\t\t\t\t\t\tUma aplicação web para a gestão de recursos humanos, especificamente no domínio da tradução.<br>\n\t\t\t\t\t\t\t\tFoca-se no processo de recrutamento de tradutores/empresas de tradução. Também contempla a possibilidade de integração com TMS (Translation Management System), permitindo uma gestão continua dos recursos de tradução.",
    "hrm-link": "<a href=\"https://altec-is.pt/#hrm\" target=\"_blank\"><i class=\"icon-link\"></i>&nbsp;Link para página</a>",
    "crm-desc": "Uma aplicação web para a gestão dos relacionamentos dos seus contactos.<br>\n\t\t\t\t\t\t\t\t Através da API do Gmail, estabelece uma conexão com a sua conta de email e faz um mapeamento dos seus emails em contactos, empresas e oportunidades. É uma ferramenta importante para a organização dos seus atuais e possíveis clientes e até para gestão dos seus recursos/fornecedores.",
    "geocareyes-desc": "Uma interface dinâmica para a gestão de frotas.<br>\n\t\t\t\t\t\t\t\t Ofereçe serviços como monitorização em tempo real dos veículos, fluxo de tráfego, alertas, serviços agendados, índices de eficiência, entre outros. Toda esta informação é apresentada através de um mapa gerado por Leaflet.js. Esta aplicação serve de complemento ao produto GeoCar desenvolvido pela Gisgeo.\n\t\t\t\t\t\t\t\t",
    "cataloguer-desc": "Uma aplicação web para a criação e estilização de catálogos online.<br>\n\t\t\t\t\t\t\t\tAtravés de uma listagem de produtos (CSV), um utilizador poderá fazer o upload dos seus produtos e estilizar os cartões para os mesmos, bem como estilizar a página onde os produtos serão apresentados.<br>\n\t\t\t\t\t\t\t\tApós a estilização pretendida estiver terminada, é gerado um link público para o acesso ao catálogo. ",
    "cataloguer-link": "<a href=\"https://github.com/henriquefig/Cataloguer\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "qpo-desc": "Uma aplicação web para ajudar habitações partilhadas a gerirem as suas despesas partilhadas. Está direcionada para estudantes a partilharem habitações mas pode ser usado para qualquer tipo de despesa partilhada.",
    "qpo-link": "<a href=\"https://github.com/henriquefig/Quem-Paga-o-que-alternative\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "readme-converter-desc": "O conversor README é uma pequena aplicação baseada em Showdown.js para ajudar na criação de versões HTML de ficheiros README (.md).",
    "readme-converter-link": "<a href=\"https://github.com/henriquefig/Readme-converter\" target=\"_blank\"><i class=\"icon-github2\"></i>&nbsp;Link para Github</a>",
    "contact": "Contato",
    "name":"O seu nome",
    "email": "O seu endereço de email",
    "message": "A sua mensagem",
    "send-mail":"Enviar mensagem",
    "hobbies": "Passatempos",
    "cubes": "Cubos",
    "cubes-desc":"\n\t\t\t\t\t\t\t\t\tEm 2007 aprendi a resolver o cubo de Rubik e desde então, este tipo de \"twisty puzzles\" têm sido uma paixão para mim.<br>\n\t\t\t\t\t\t\t\t\tAbaixo está uma fotografia da minha <u>atual</u> coleção de cubos.\n\t\t\t\t\t\t\t\t",
    "cubes-showoff":"\n\t\t\t\t\t\t\t\t\tConsigo resolver qualquer um deles e até estive em algumas competições de cubos.<br>\n\t\t\t\t\t\t\t\t\tEstes são os meus melhores tempos para cada categoria (para alguns dos cubos eu nunca cheguei a cronometrar, portanto deixo uma média do tempo que demoro a resolvê-los):\n\t\t\t\t\t\t\t\t",
    "cubes-times":"\n\t\t\t\t\t\t\t\t\t<u>2x2x2</u>: 3.64 segundos | <u>3x3x3</u>: 9.28 segundos | <u>3x3x3 com uma mão</u>: 28.64 segundos | <u>4x4x4</u>: 46.68 segundos<br>\n\t\t\t\t\t\t\t\t\t<u>5x5x5</u>: 2:24.12 minutos | <u>7x7x7</u>: 7:48.92 minutos | <u>Megaminx</u>: 2:24.66 minutos | <u>Gigaminx</u>: ≈ 30 minutos<br>\n\t\t\t\t\t\t\t\t\t<u>Mastermorphix</u>: ≈ 2/3 minutos | <u>Megamorphix</u>: ≈ 35 minutos | <u>Gigamorphix</u>: ≈ 30 minutos<br>\n\t\t\t\t\t\t\t\t\t<u>Square-1</u> - só o resolvi uma ou duas vezes, ainda não consigo dar um tempo médio",
    "music": "Música",
    "music-desc": "\n\t\t\t\t\t\t\t\t\tQuando tinha 10 anos os meus pais acharam que seria bom para mim aprender música, como tal, começei com aulas de piano. Estes foram os meus primeiros passos na música e apesar do piano não ser um instumento que eu quisess particularmente aprender, despertou o meu interesse em criar música.<br>\n\t\t\t\t\t\t\t\t\tEm 2011 peguei num baixo pela primeira vez e tem sido o meu instrumento de escolha desde então!<br>\n\t\t\t\t\t\t\t\t\tAbaixo está uma fotografia do meu querido baixo.\n\t\t\t\t\t\t\t\t",
    "where-i-am": "De momento, vivo no Porto",
    "see-more": "Clique para ver mais",
    "gaming": "Jogos",
    "gaming-desc": "E claro, jogos! Adoro explorar um jogo novo, seja pela sua historia intrigante, para completar todas as pequenas coleções, seja para superar todos os <i>bosses</i> ou desafio mais dificeis.<br> Tendo mais para o lado de jogos <i>offline</i> (Nintendo <i>fanboy</i>!) mas vou metendo o meu pé no <i>online</i> para jogar World Of Warcraft!<br>Fica uma imagem de um dos meus jogos favoritos, Celeste!"
}